Delans-TLE/src/Catalogs/ПродукцияВЕТИС/ПродукцияВЕТИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПродукцияВЕТИС</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ЖивыеЖивотные</name>
      <description>Живые животные</description>
    </items>
    <items>
      <name>КормаИКормовыеДобавки</name>
      <description>Корма и кормовые добавки</description>
    </items>
    <items>
      <name>ЛекарственныеСредства</name>
      <description>Лекарственные средства</description>
    </items>
    <items>
      <name>МясоИМясопродукты</name>
      <description>Мясо и мясопродукты</description>
    </items>
    <items>
      <name>НепищевыеПродуктыИДругое</name>
      <description>Непищевые продукты и другое</description>
    </items>
    <items>
      <name>ПищевыеПродукты</name>
      <description>Пищевые продукты</description>
    </items>
    <items>
      <name>ПродукцияНеТребующаяРазрешения</name>
      <description>Продукция не требующая разрешения</description>
    </items>
    <items>
      <name>РыбаИМорепродукты</name>
      <description>Рыба и морепродукты</description>
    </items>
  </predefined>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>DefinedType.УникальныйИдентификаторВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторВерсии</name>
    <type>
      <types>DefinedType.УникальныйИдентификаторВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыВерсионныхОбъектовВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПродукции</name>
    <type>
      <types>CatalogRef.ПродукцияВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>КодТНВЭД</name>
    <type>
      <types>DefinedType.СтрокаВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>Продукция</name>
    <type>
      <types>CatalogRef.ПродукцияВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПродукции</name>
    <type>
      <types>CatalogRef.ПродукцияВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>СоответствуетГОСТ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГОСТ</name>
    <type>
      <types>DefinedType.СтрокаВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>DefinedType.СтрокаВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>GTIN</name>
    <type>
      <types>DefinedType.GTIN</types>
    </type>
  </attributes>
  <attributes>
    <name>ФасовкаУпаковка</name>
    <type>
      <types>CatalogRef.УпаковкиВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ФасовкаКоличествоУпаковок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФасовкаЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмеренияВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ФасовкаКоличествоЕдиницВУпаковке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХешСумма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяЗагрузка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйствующийСубъектПроизводитель</name>
    <type>
      <types>CatalogRef.ХозяйствующиеСубъектыВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйствующийСубъектПроизводительИдентификатор</name>
    <type>
      <types>DefinedType.УникальныйИдентификаторВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйствующийСубъектСобственникТорговойМаркиИдентификатор</name>
    <type>
      <types>DefinedType.УникальныйИдентификаторВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>Произвольная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Производители</name>
    <attributes>
      <name>Производитель</name>
      <type>
        <types>CatalogRef.ПредприятияВЕТИС</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Delans-TLE/src/Catalogs/ПродукцияВЕТИС/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция возвращает текст запроса информация о сопоставлении номенклатуры
// 
// Возвращаемое значение:
//  Строка - текст запроса
//
Функция ТекстЗапросаИнформацияОСопоставлении() Экспорт
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ПродукцияВЕТИС.Ссылка КАК Продукция,
	|	КОЛИЧЕСТВО(ПродукцияВЕТИС.Производитель) КАК КоличествоПроизводителей,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ПродукцияВЕТИС.НомерСтроки = 1
	|				ТОГДА ПродукцияВЕТИС.Производитель
	|			ИНАЧЕ NULL
	|		КОНЕЦ) КАК Производитель
	|ПОМЕСТИТЬ ВтПроизводители
	|ИЗ
	|	Справочник.ПродукцияВЕТИС.Производители КАК ПродукцияВЕТИС
	|ГДЕ
	|	ПродукцияВЕТИС.Ссылка В(&Продукция)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПродукцияВЕТИС.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Продукция
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СоответствиеНоменклатурыВЕТИС.Продукция КАК Продукция,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СоответствиеНоменклатурыВЕТИС.Номенклатура) КАК Количество
	|ПОМЕСТИТЬ СопоставленоПозиций
	|ИЗ
	|	РегистрСведений.СоответствиеНоменклатурыВЕТИС КАК СоответствиеНоменклатурыВЕТИС
	|ГДЕ
	|	СоответствиеНоменклатурыВЕТИС.Продукция В(&Продукция)
	|
	|СГРУППИРОВАТЬ ПО
	|	СоответствиеНоменклатурыВЕТИС.Продукция
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Продукция
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Товары.Ссылка КАК Ссылка,
	|	Товары.ЭтоГруппа КАК ЭтоГруппа,
	|	ЕСТЬNULL(СопоставленоПозиций.Количество, 0) КАК Количество,
	|	СоответствиеНоменклатурыВЕТИС.Номенклатура КАК Номенклатура,
	|	СоответствиеНоменклатурыВЕТИС.Характеристика КАК Характеристика,
	|	ПРЕДСТАВЛЕНИЕ(СоответствиеНоменклатурыВЕТИС.Номенклатура) КАК НоменклатураПредставление,
	|	ЕСТЬNULL(ВтПроизводители.КоличествоПроизводителей, 0) КАК КоличествоПроизводителей,
	|	ВтПроизводители.Производитель КАК Производитель,
	|	ПРЕДСТАВЛЕНИЕ(ВтПроизводители.Производитель) КАК ПроизводительПредставление
	|ИЗ
	|	Справочник.ПродукцияВЕТИС КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ СопоставленоПозиций КАК СопоставленоПозиций
	|		ПО (СопоставленоПозиций.Продукция = Товары.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтПроизводители КАК ВтПроизводители
	|		ПО (ВтПроизводители.Продукция = Товары.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеНоменклатурыВЕТИС КАК СоответствиеНоменклатурыВЕТИС
	|		ПО Товары.Ссылка = СоответствиеНоменклатурыВЕТИС.Продукция
	|			И (СопоставленоПозиций.Количество = 1
	|				ИЛИ СоответствиеНоменклатурыВЕТИС.Порядок = 1)
	|ГДЕ
	|	Товары.Ссылка В(&Продукция)";
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#КонецЕсли

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы = "ФормаОбъекта" Тогда
		Если Параметры.Свойство("Ключ") И ЗначениеЗаполнено(Параметры.Ключ) Тогда
			ПроизвольнаяПродукция = ИнтеграцияВЕТИСВызовСервера.ЗначениеРеквизитаОбъекта(Параметры.Ключ, "Произвольная");
			Если ПроизвольнаяПродукция Тогда
				ВыбраннаяФорма = "ПроизвольнаяПродукция";
				СтандартнаяОбработка = Ложь;
			КонецЕсли;
		Иначе
			СтандартнаяОбработка = Ложь;
			ВыбраннаяФорма = "ПомощникСоздания";
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Ссылка");
	Поля.Добавить("Наименование");
	
	Поля.Добавить("ЭтоГруппа");
	Поля.Добавить("ТребуетсяЗагрузка");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Если Данные.ТребуетсяЗагрузка = Истина Тогда
		СтандартнаяОбработка = Ложь;
		Представление = НСтр("ru = '<не загружено>'");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
